{
    "base_phrase": "Your password must contain %s.",
    "join_and_middle": ", ",
    "join_and_end": " and ",
    "join_or_middle": ", ",
    "join_or_end": " or ",
    "article_types": ["definite", "indefinite", "numeral"],
    "articles": [
        {
            "category": "single",
            "type": "indefinite",
            "text": {
                "_":           "a %s",
                "start_vowel": "an %s"
            }
        },
        {"category": "single",      "type": "definite", "text": "the %s"},
        {"category": "single",      "type": "numeral", "quantity": 1, "text": "one (1) %s"},
        {"category": "multiple",    "type": "indefinite", "text": "%s"},
        {"category": "multiple",    "type": "definite", "text": "the %s"},
        {"category": "multiple",    "type": "numeral", "quantity": 2, "text": "two (2) %s"},
        {"category": "multiple",    "type": "numeral", "quantity": 3, "text": "three (3) %s"},
        {"category": "multiple",    "type": "numeral", "quantity": 4, "text": "four (4) %s"},
        {"category": "multiple",    "type": "numeral", "quantity": 5, "text": "five (5) %s"},
        {"category": "multiple",    "type": "numeral", "quantity": 6, "text": "six (6) %s"},
        {"category": "multiple",    "type": "numeral", "quantity": 7, "text": "seven (7) %s"},
        {"category": "multiple",    "type": "numeral", "quantity": 8, "text": "eight (8) %s"},
        {"category": "multiple",    "type": "numeral", "quantity": 9, "text": "nine (9) %s"},
        {"category": "multiple",    "type": "numeral", "quantity": 10, "text": "ten (10) %s"},
        {"category": "multiple",    "type": "numeral", "quantity": 11, "text": "eleven (11) %s"},
        {"category": "multiple",    "type": "numeral", "quantity": 12, "text": "twelve (12) %s"},
        {"category": "uncountable", "type": "indefinite", "text": "%s"}
    ],
    "stand_alone": {
        "cc_by_sa": [
            "the answer to life, the universe and everything",
            "the truth, the whole truth, and nothing but the truth"
        ],
        "cc_by_nc": [
            "your safeword, which must be 8–16 characters long and contain a capital letter, a lowercase letter, a number, a",
            "its own infinitive, subjunctive, and imperative forms",
            "a hook, a line, and a sinker",
            "hot cocoa and at least seven (7) mini-marshmallows",
            "just a salad",
            "some questionable practices",
            "beach glass, shell fragments, and wrack",
            "the truth, the whole truth, and nothing but the truth",
            "three (3) words that can only be pronounced by someone with a mouthful of marbles",
            "chili, cornbread, and antacids",
            "a four-alarm fire and some marshmallows",
            "three (3) tracks from a mix tape, or four (4) pennies if you're too young to know what a mix tape is",
            "peristalsis and borborygmi",
            "at least one (1) Kardashian",
            "three birds and a word",
            "appropriate safety equipment at all times",
            "a toll-free number, a bloody nose, and a cork",
            "bagels, cream cheese, and locks. Not lox. Locks",
            "surrealism",
            "the letter B-A-bay, B-E-bee, B-I-bicky-bi, B-O bo, bicky-bi bo, B-U bu, bicky bi bo bu",
            "your perfect ears",
            "tomatoes, potatoes, pajamas, and the Bahamas",
            "a stunning reversal of fortune in the fourth act",
            "golden-green ginkgo leaves",
            "conch fritters and a handful of sand",
            "(╯°□°）╯︵ ┻━┻",
            "a false alarm",
            "three halos, a clothes hanger, and a length of black velvet",
            "two truths and a lie",
            "bleeps, sweeps, and creeps",
            "Schweppervescent street ghetto essence",
            "a laurel and a hearty handshake",
            "a coelacanth, a caecilian, and a cyst",
            "rhythm, music, and a man",
            "an argument that is not just contradiction",
            "maize, beans, and squash",
            "one (1) master and one (1) apprentice. Always",
            "an impeccable sense of style",
            "all the major food groups and a partitioned cafeteria tray",
            "a bipartisan commission",
            "the best hits from the 80s, 90s, and today",
            "spray cheese, a Winnebago, and very strong glue",
            "a spoiled ballot",
            "Adam and Eve on a raft",
            "most of the water and all the power",
            "its own weight in gold",
            "a complete bibliography in MLA format",
            "50,000 words",
            "a cunning plan",
            "a spendthrift, some spindrift, and a queue",
            "insomnia",
            "a Hershey's miniature, a Tootsie Roll, and a slightly sticky small child",
            "a ray of sunshine",
            "earth and water",
            "an explanation of the difference between a mongoose and a monsoon",
            "a goofy Halloween pun on your usual password",
            "your public key, your private key, your house key, and three piano keys",
            "a minimum of one (1) epic fail",
            "adorable kitten snores",
            "a prank call",
            "the man entry for ls as it was written in 1983",
            "the last 10 words you used when playing Mad Libs",
            "an all-expenses-paid cruise to the Bahamas",
            "the current whereabouts of Jimmy Hoffa",
            "a perfect copy of yourself rendered entirely in cheese",
            "a perfectly-coded path from an OCRed date string to a UNIX UTC timestamp, in PHP, WITHOUT USING GOOGLE",
            "the phone number of your best friend in kindergarten",
            "interrupting cowMOOOOOOOOOO",
            "your first-born child as collateral",
            "unparseable non-printable characters",
            "some free time",
            "a dust bunny, a tumbleweed, and some kludgy old code",
            "a non-racist Halloween costume",
            "a ham-handed smear campaign against those you believe to be your enemies",
            "a yo-yo, a Ho-Oh, and a bottle of rum",
            "a loud slurping sound",
            "a flawed analysis based on questionable data",
            "a milkshake, an anaconda, and some junk",
            "one full hour. You'll get it back when the password expires",
            "six parts gin to one part vermouth",
            "a shiny gold star",
            "weevils",
            "an ethical conundrum involving autumn leaves, granite, and pie",
            "a little list of people who never will be missed",
            "braaaaaains",
            "a billy goat, a billy club, and a bilious shade of green",
            "an altostratus or altocumulus cloud. Nimbostratus clouds will only be accepted if you use Firefox or Chrome",
            "an irregular verb",
            "three obscure references to delight longtime fans",
            "a good night's sleep",
            "seventeen grams of nanobots",
            "meta",
            "the page numbers of your last Choose Your Own Adventure adventure",
            "an automated system with a friendly robot voice. Press 3 to continue or * to hear these requirements again",
            "a green and blue marble",
            "a clickbait headline",
            "a collage of newspaper clippings",
            "four matching aiglets and a susurration",
            "a quick trip to the store for some eggs",
            "unobtanium",
            "the building blocks of the world",
            "something old, something new, something borrowed, and something blue",
            "a bark, meow, chirp, whinny, or whale song",
            "a mystery, wrapped in an enigma, buried in bacon",
            "a half-brick",
            "a complimentary watch",
            "an excuse from your parent or guardian",
            "an ancient curse",
            "all the ingredients to make an anti-aging serum",
            "more on the inside than on the outside",
            "the spark of life",
            "a continent",
            "six techniques for overcoming the urge to procrastinate",
            "a song, a dance, and a little seltzer",
            "three characters with handakuten and a sokuon",
            "enough candy for all of the children in your neighborhood",
            "a URL to a website published before the year 2000 that still looks good today",
            "properly escaped single quotes",
            "all the dust under your radiator. If you don't have a radiator, dust from the top of a bookcase is acceptable",
            "a sound file of you giggling to yourself for 60 seconds straight",
            "a solution to a randomly generated Rubik's cube, written in Lisp",
            "all of the elements in the periodic table sorted by density",
            "four sugar packets, a squirrel, and a detailed statistical refutation of Murphy's Law",
            "magic so potent that none would DARE attempt to break in",
            "three unverifiable facts about Susan B. Anthony",
            "enough cat or dog fur to build a duplicate pet. Those with three or more pets are excused",
            "the exact phrase that ran through your head the first time you realized the world is bigger than yourself",
            "your five most recent diary entries in reverse date order",
            "a woman with the eyes of an eagle, staring into the void, still and quiet. And your favorite pet",
            "at least three major rules of Dragon Poker, along with all variants for each rule",
            "precisely one twerk",
            "the seeds of its own destruction",
            "a Russian word borrowed from French",
            "footie pajamas, turpentine, and a bowl of ramen",
            "valid driving directions obtained from Apple Maps",
            "seventeen six-syllable words and be bound in red leather with gilt lettering",
            "three angles adding up to at least 200 degrees",
            "two of the four seasons and a Claritin Redi-Tab",
            "buttered popcorn, a pebble, and three hairs from your upper lip",
            "the secret handshake that indicates that you're a member of [hidden society]",
            "a made-up fact about whales and your Social Security number",
            "dynamic HTML",
            "enough characters to flesh out the plot",
            "THE POWER OF LOVE",
            "all quest items in order to close the portal",
            "itself, backwards..sdrawkcab ,flesti niatnoc tsum drowssap rouY",
            "a logo in order to be considered valid",
            "the sun and stars",
            "the number of licks it takes to get to the center of a Tootsie Pop",
            "a towel",
            "8-16 alphanumeric characters and must never have been used before by anyone, anywhere, ever",
            "16-, 32-, and 64-pixel versions of itself",
            "five paragraphs on the destruction of the Library of Alexandria, double-spaced, Times New Roman 12, by Friday",
            "Fizzy Lifting Drink",
            "diminishing returns and a tiny seed of doubt",
            "seven pairs of every animal",
            "your FACE",
            "agar manna.\n#wordpuzzle",
            "an ethernet port",
            "a smaller, more perfect password",
            "an unhatched phoenix egg and a pair of silver oven tongs",
            "your password must contain your password must contain your password must contain your password must contain your",
            "a child-like sense of wonder about the world",
            "the complete lyrics of \"Eskimo Nell.\"",
            "48 characters including a Friar, a Chanticleer, a Franklin, a Yeoman, and a Wife of Bath. #ChaucerDoethInfoSec",
            "Candleja--",
            "new car smell",
            "at least sixteen characters plus an honest thief, a night without a day, and a day without a night",
            "\"paw,\" \"woo,\" \"sour,\" or another word made from the letters in \"your password.\"",
            "the lost scripts for Firefly Season 2",
            "the entire collection of Rocky Horror Picture Show callbacks",
            "a high school diploma",
            "one of your senses. Your choice",
            "an antidote to the poison that's just been injected into you",
            "your firstborn child or a reasonable facsimile thereof",
            "one memory of a perfect day. (Non-refundable.)",
            "8-16 alphanumeric characters.\n\nOR MUST IT?!?",
            "a grammatically perfect sentence in Katharevousa declaring your love of wiffle bats",
            "great green gobs of greasy grimy gopher guts, 99 bottles of beer, and Henry VIII",
            "a quest object, MacGuffin, red herring, or devastating family secret",
            "an explanation of whether you bring the thread to the needle or the needle to the thread",
            "all the words added to the latest edition of the Scrabble Dictionary",
            "your telepathic twin sibling's password. No guessing",
            "a fox wearing socks in a box",
            "a pumpkin spice latte",
            "travel rations sufficient for a party of 5",
            "a loaf of bread, a jug of wine, and thou",
            "signed prior authorization",
            "a flashlight, a towel, a leaflet, and a grue",
            "a cunning disguise and a dugong",
            "a spider to catch the fly. I don't know why",
            "the Poké Ball containing Mew that can only be found under that one truck",
            "the elixir of life and a special character",
            "the names of at least three countries that don't use metal coinage as part of their currency",
            "the exact make and model of the battery installed in the very first car that your parents ever owned",
            "a fully operational Death Star",
            "your blood type, your mother's maiden name, and the street you grew up on.\n\n>.>",
            "a pamphlet discussing the risks of heart disease",
            "the means to run an instance of Microsoft Bob",
            "a clear path to the nearest exit, written entirely in Logo commands",
            "a self-addressed stamped envelope",
            "enough fuel to fill a Boeing 747",
            "the US Bill of Rights translated into Esperanto",
            "an apology for the 1997 film Batman & Robin",
            "a creamy nougat center",
            "one (1) confirmed UFO sighting, an origami giraffe, and a shot of bourbon",
            "proof of purchase",
            "a fifteen-foot-tall replica of the Stay Puft Marshmallow Man made entirely of uncooked ramen noodles",
            "a valid 2-year warranty",
            "blueprints for the building across the street",
            "two contradictory trending hashtags",
            "at least three valid references",
            "wood, earth, water, fire, and metal, and may not be four characters long",
            "FIIIVE GOOOLD RIIIIINGS",
            "at least one of the following: uppercase letters, lowercase letters, handwritten love letters, runic letters",
            "the evil opposite of itself",
            "whosoever shall be found without the soul for getting down and the funk of forty thousand years",
            "viable alternatives to dairy",
            "one item from each of the food groups",
            "the sound of the alien signal from the movie Independence Day",
            "LOLcode that compiles successfully to print out all the known digits of pi",
            "the answer's to last week's test",
            "an elephant",
            "elements of magic, serenity, sorcery, and mystery",
            "a SQL injection attack. Good luck!",
            "a decent bribe for your IT department so you never have to change your password again",
            "a nail file and some fondant",
            "NEVER GONNA GIVE YOU UP, NEVER GONNA LET YOU DOWWWN",
            "a grid",
            "these 12 HOT celebrity photos! You won't believe your eyes!",
            "at least one emoji and a MySQL injection",
            "its own seed, its own lesson on how to improve your password the next time",
            "the password to the password keychain that stores all your other passwords. We'll, uh, keep it safe for you. Yes",
            "seeds, shell fragments, and traces of tree nuts, wheat, and milk",
            "rhythm, or it'll attract the worm",
            "suffering, even as I suffer",
            "A-Z, 1-2-3, do-re-mi, baby, you and me, girl",
            "soy lecithin, calcium carbonate, and sodium laurel sulfate",
            "the thing with the guy in the place",
            "whatever's written on that Post-It stuck to the side of your monitor. Is that a 7? I can't even read this",
            "the UTC Unix timestamp of when you first learned how to walk",
            "the name of a very very good dog. Who's a good password? Whoooo's a good password? You! Yes you are",
            "a comma. That's it--just a comma",
            "your mother's maiden name, your third grade teacher's name, and your father's brother's nephew's cousin's former",
            "valid photo ID",
            "the astrological star chart for Genghis Khan",
            "a plan for capitalizing on the success of your previous passwords",
            "one uppercase letter, one lowercase letter, one number, one symbol, one non-printing ASCII character, one punctua",
            "three gallons of Gatorade, seventeen Klout points, and a system for beating the house",
            "all fifty state capitals in alphabetical order GO",
            "iocaine powder",
            "the logo of your favorite TV show converted to base64",
            "a great big thank you and hello to all our followers so far! (16 characters or less)",
            "a bell, a book, and a candle",
            "an alphanumer--excuse me a minute. GET DOWN FROM THERE. I SAID GET DOWN. KNOCK IT OFF. Anyway, sorry, where was I",
            "your last email. We'll know whether you did this or not",
            "the secret ingredient in your parent's casserole. Yum yum!",
            "CFC-free propellants and the salty dust from the bottom of a Pringles can",
            "a coffee, medium, two sugars. I'm dyin' here",
            "THE BLOOP",
            "a Twinkie that represents the normal amount of psychokinetic energy in the New York area",
            "a method for safely dropping an egg from the top of a five-storey building",
            "the first verse of a Nickelback song written using the Parsons code",
            "chemicals known to the state of California to cause cancer",
            "ASTERISKS. HA",
            "a valid translation of the Voynich Manuscript and a lowercase letter",
            "four and twenty blackbirds and a plum",
            "a skeleton in order to gain entry to THE SKELETON WAR",
            "language that clearly identifies the parties involved",
            "itself; it's making a scene",
            "the lotion or it gets the hose again",
            "a well-formed WHERE clause",
            "the opposing team's spread offense in order to win Saturday's game",
            "a recipe for cookies with hashish and no eggs",
            "enough foot-pounds of thrust to reach escape velocity, an umlaut, and diphtheria",
            "7 years of back taxes due to the US government",
            "a magnetic alloy",
            "no more than 100 ml (3.4 oz) of liquid or gel",
            "the legend \"crunchy, raw, unboned real dead frog\" if you want to avoid prosecution!",
            "a portrait of the artist as a young man and a momentary lapse of reason",
            "your password, tautologically enough",
            "photographic evidence that Han shot first",
            "Your password must contain... a NEW CAR!!!",
            "one year of your life",
            "a faaaaabulous window treatment",
            "one (1) functioning kidney and directions to the nearest hospital",
            "the third word on the second page of the manual included with this game",
            "pics or it didn't happen",
            "that one color between chartreuse and puce",
            "where it got that dress. Was it on sale?",
            "the last known locations of Carmen Sandiego and Ferris Bueller",
            "attack ships on fire off the shoulder of Orion, and c-beams glittering in the dark near the Tannhäuser Gate",
            "no artificial additives or preservatives",
            "valid Scrabble words whose score adds up to a prime number greater than 97",
            "an independent clause containing a subject and verb",
            "a road trip in which we sing Love Shack at the top of our lungs, and an algorithm for proving me wrong",
            "the airspeed velocity of an unladen swallow",
            "all cheat codes for Kings Quest IV",
            "a set of feet\n   (or iambs, as they're called) to be complete",
            "non-Euclidean geometry, the hair of a goat, and one (1) silver dime",
            "the reason it won't return my calls :-(",
            "the rain that falls mainly on the plain in Spain",
            "a chromatic analysis of Dali's The Persistence of Memory and a sneeze",
            "the keys to your house. No reason",
            "the brew that is true",
            "this one weird trick that unlocks your account!\n#buzzfeed",
            "a defense for your grad school dissertation",
            "the summoning chant for an Elder God and the fifth ingredient on that can of Cheez Whiz",
            "the set of all passwords that contain themselves and what Bruce Schneier had for breakfast last Tuesday",
            "four whole fried chickens and a Coke",
            "a recipe for apple crumble",
            "your hat size, the Latin name for the last plant you saw, and one (1) hieroglyph",
            "your reason for living and the original name of your grandfather's favourite whiskey"
        ]
    },
    "nouns": [
        [
            {"categories": ["single"],   "text": "thing"},
            {"categories": ["multiple"], "text": "things"}
        ],
        [
            {"categories": ["single"],   "articles": ["indefinite"], "text": "leprechaun"},
            {"categories": ["multiple"], "text": "leprechauns"}
        ],
        [
            {"categories": ["single"],   "articles": ["indefinite"], "text": "unicorn"},
            {"categories": ["multiple"], "text": "unicorns"}
        ],
        [
            {"categories": ["single"],   "articles": ["indefinite"], "text": "milk brand"},
            {"categories": ["multiple"], "text": "milk brands"}
        ],
        [
            {"categories": ["uncountable"], "articles": ["indefinite"], "text": "dirt"}
        ],
        [
            {"categories": ["uncountable"], "articles": ["indefinite"], "text": "water"}
        ],
        [
            {"categories": ["uncountable"], "articles": ["indefinite"], "text": "lava"}
        ],
        [
            {"categories": ["single"], "articles": ["definite"], "text": "holy grail"}
        ]
    ]
}
